<template>
   <div class="page-content">
      <h1 class="title">
         Информация обо мне
      </h1>

      <div class="about-text">
         <p>
            Немного истории. Меня зовут Александр. С 2003 года не утихает моя страсть к компьютерной технике, как-то я с
            ней подружился. Долго ли, коротко ли, но эта дорога IT увлечениями привела меня во фронтенд разработку, чем,
            собственно, сейчас и занимаюсь большую часть времени. Если более предметно, то весь профессиональный путь
            можно разделить на несколько этапов:
         </p>
         <ul>
            <li>
               Школа. В 10-ом классе у меня дома появился компьютер (Celeron 1700/128мб/64мб/40гб/17`), с него-то все и
               началось, и 90% всего свободного времени я проводил вместе с ним вплоть до университета.
            </li>
            <li>
               Закончил КГТУ (Костромской Государственный технологический университет) с 2-мя дипломами по
               специальностям:
               <ol>
                  <li>
                     Информационные системы (факультет автоматизированных систем и технологий).
                  </li>
                  <li>
                     Бухгалтерский учет и аудит (институт дополнительного профессионального образования).
                  </li>
               </ol>
            </li>
            <li>
               Немного потрудился по специальности и пошел посмотреть армию... Посмотрел, есть что вспомнить, но не
               понравилось.
            </li>
            <li>
               Сняв "керзачи", надел мантию ИП примерно на 7 лет и усердно занимался созданием строительных сайтов на
               php-движках на заказ.
            </li>
            <li>
               Потом что-то пошло не так, закрыл ИП и решил поработать руками на стройке, это быстро надоело, так как
               расти некуда.
            </li>
            <li>
               Устроился в компанию 4px джуном на full-stack, проработал там полгода, при этом активно изучал фреймворк
               VUE для себя. Пандемия. Зарплата = 0. Ушел.
            </li>
            <li>
               Меня взяли на позицию Middle Frontend разработчика в Skill-Branch, где и работаю по сей день. Веду
               несколько проектов на Nuxt.js (LMS, Админка, Лендинги и др.).
            </li>
         </ul>

         <p>
            Стараюсь пополнять свой багаж знаний различными темами из мира фронтенда. Играю на гитаре, интересуюсь
            космосом, не пью.
         </p>
      </div>
   </div>
</template>

<script>
    export default {
        name: "AboutPage",
        transition: {
            name: 'animate_fading',
            mode: 'out-in'
        }
    }
</script>

